# Taps
tap "homebrew/cask"
tap "homebrew/core"

# Formulae (CLI tools)
brew "git"
brew "neovim"
brew "mas"
brew "neofetch"

# Casks (GUI applications)
cask "alt-tab"
cask "arc"
cask "discord"
cask "iterm2"
cask "karabiner-elements"
cask "jordanbaird-ice"
cask "visual-studio-code"

# MAS for Mac App Store Apps
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Flow", id: 1423210932
mas "OmniFocus", id: 1542143627
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
